Revit 2026 API

# DirectShapeReferenceOptionsGetExternalGeometryId Method

---

Retrieves the ExternalGeometryId associated with the reference object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalGeometryId GetExternalGeometryId()
```
```vb
Public Function GetExternalGeometryId As ExternalGeometryId
```
```cpp
public:
ExternalGeometryId^ GetExternalGeometryId()
```
```fsharp
member GetExternalGeometryId : unit -> ExternalGeometryId
```

#### Return Value

ExternalGeometryId

If an ExternalGeometryId has not been set, this method returns .

#### Reference

DirectShapeReferenceOptions Class

Autodesk.Revit.DB Namespace